LearnRoR/Blog/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "A"], ["body", "BCDF SDF DSF DSF"], ["created_at", "2023-12-04 08:57:27.233338"], ["updated_at", "2023-12-04 08:57:27.233338"], ["status", "public"]]