LearnRoR/demo_pagination/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
	@pagy,
    @posts = pagy(Post.all)

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "OK"], ["body", "Body 1"], ["created_at", "2023-12-06 09:17:23.498329"], ["updated_at", "2023-12-06 09:17:23.498329"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save